lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/common.cpp
    void writeBytes(int spi_host, const uint8_t* data, size_t len)
    {
      uint32_t spi_port = (spi_host + 1);
      (void)spi_port;
      if (len > 64) len = 64;
      memcpy(reinterpret_cast<void*>(SPI_W0_REG(spi_port)), data, (len + 3) & ~3);
      writereg(SPI_MOSI_DLEN_REG(spi_port), (len << 3) - 1);
      writereg(SPI_CMD_REG(      spi_port), SPI_EXECUTE);
      while (*reg(SPI_CMD_REG(spi_port)) & SPI_USR);
    }

    void readBytes(int spi_host, uint8_t* data, size_t len)
    {
      uint32_t spi_port = (spi_host + 1);
      (void)spi_port;
      if (len > 64) len = 64;
      memcpy(reinterpret_cast<void*>(SPI_W0_REG(spi_port)), data, (len + 3) & ~3);
      writereg(SPI_MOSI_DLEN_REG(spi_port), (len << 3) - 1);
      writereg(SPI_CMD_REG(      spi_port), SPI_EXECUTE);
      while (*reg(SPI_CMD_REG(spi_port)) & SPI_USR);

      memcpy(data, reinterpret_cast<const void*>(SPI_W0_REG(spi_port)), len);
    }
  }

//----------------------------------------------------------------------------
  static constexpr const int __DECLARE_RCC_ATOMIC_ENV = 0;

  namespace i2c
  {
#if __has_include( <core_version.h> )
  #include <core_version.h>
#endif

#if !defined ( I2C_ACK_ERR_INT_RAW_M )
 #define I2C_ACK_ERR_INT_RAW_M I2C_NACK_INT_RAW_M
#endif

// From the ESP32-C6 on, some chips carry a low power I2C in addition to the normal ones,
// and SOC_I2C_NUM counts both of them. SOC_HP_I2C_NUM / SOC_LP_I2C_NUM tell them apart,
// but they only exist in recent ESP-IDF, so the chips with a single high power port have
// to be named when they are missing.
#if defined ( SOC_HP_I2C_NUM )
 #define LGFX_HP_I2C_NUM SOC_HP_I2C_NUM
#elif defined ( CONFIG_IDF_TARGET_ESP32C2 ) || defined ( CONFIG_IDF_TARGET_ESP32C5 ) || defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32C61 )
 #define LGFX_HP_I2C_NUM 1
#else
 #define LGFX_HP_I2C_NUM SOC_I2C_NUM
#endif

// ESP-IDF numbers the low power ports after all the high power ones, so the first low
// power port index is the number of high power ports. ( see i2c_port_t in hal/i2c_types.h )
//
// Bringing a low power port up is left to the ESP-IDF driver: there is no TwoWire for it,
// and the pads reach the peripheral differently depending on the chip ( a fixed LP IO MUX
// function on some, the LP GPIO matrix on others ). The driver already knows which, so it
// is asked to open the bus and the registers are taken over afterwards, exactly as this
// code does for the normal ports.
#if defined ( SOC_LP_I2C_NUM ) && ( SOC_LP_I2C_NUM > 0 ) && __has_include ( <driver/i2c_master.h> ) \
 && defined ( ESP_IDF_VERSION_VAL ) && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 4, 0)
 #define LGFX_LP_I2C_NUM SOC_LP_I2C_NUM
 #define LGFX_LP_I2C_PORT LGFX_HP_I2C_NUM
 // The default source is the RC oscillator, which drifts with temperature. XTAL_D2 is a
 // divided crystal, so the SCL frequency comes out as asked.
 #define LGFX_LP_I2C_SCLK LP_I2C_SCLK_XTAL_D2
 #include <esp_clk_tree.h>
#else
 #define LGFX_LP_I2C_NUM 0
#endif

    /// True if this port index belongs to the low power I2C.
    static inline bool isLpPort(int i2c_port)
    {
#if LGFX_LP_I2C_NUM > 0
      return i2c_port >= LGFX_LP_I2C_PORT;
#else
      (void)i2c_port;
      return false;
#endif
    }

    /// Hardware FIFO depth of this port. The low power I2C has a shallower FIFO than the
    /// normal one, so this cannot be a single constant for the whole chip.
    static inline uint32_t getFifoLen(int i2c_port)
    {
#if LGFX_LP_I2C_NUM > 0 && defined ( SOC_LP_I2C_FIFO_LEN )
      if (isLpPort(i2c_port)) { return SOC_LP_I2C_FIFO_LEN; }
#else
      (void)i2c_port;
#endif
#if defined ( SOC_I2C_FIFO_LEN )
      return SOC_I2C_FIFO_LEN;
#else
      return 32;
#endif
    }

    /// Clock feeding the SCL divider of this port [Hz].
    /// This is not a property of the chip alone: the low power I2C runs from its own
    /// clock, and on the older chips the normal one follows the CPU frequency.
    static inline uint32_t getSourceClock(int i2c_port)
    {
#if LGFX_LP_I2C_NUM > 0
      if (isLpPort(i2c_port))
      { // Ask the clock tree rather than assuming a figure: which source the low power
        // port runs from is a choice made when the bus is opened, and the two are not
        // the same clock even where they happen to share a nominal frequency.
        uint32_t hz = 0;
        if (ESP_OK == esp_clk_tree_src_get_freq_hz((soc_module_clk_t)LGFX_LP_I2C_SCLK
                    , ESP_CLK_TREE_SRC_FREQ_PRECISION_APPROX, &hz) && hz)
        {
          return hz;
        }
        return 20 * 1000 * 1000;
      }
#else
      (void)i2c_port;
#endif

#if defined (CONFIG_IDF_TARGET_ESP32C2) || defined (CONFIG_IDF_TARGET_ESP32C3) || defined ( CONFIG_IDF_TARGET_ESP32C5 ) || defined (CONFIG_IDF_TARGET_ESP32S3) || defined ( CONFIG_IDF_TARGET_ESP32C6 ) || defined ( CONFIG_IDF_TARGET_ESP32C61 ) || defined ( CONFIG_IDF_TARGET_ESP32P4 )
      return 40 * 1000 * 1000; // XTAL clock
#else
      rtc_cpu_freq_config_t cpu_freq_conf;
      rtc_clk_cpu_freq_get_config(&cpu_freq_conf);
      if (cpu_freq_conf.freq_mhz < 80)
      { // The source follows the CPU frequency here, so it has to be read every time
        // rather than cached when the port is initialized.
        return (cpu_freq_conf.source_freq_mhz * 1000000) / cpu_freq_conf.div;
      }
      return 80 * 1000 * 1000;
#endif
    }

#if !defined ( I2C_CLOCK_SRC_ATOMIC )
  #if __cplusplus <= 201103L
    #define LGFX_PERIPH_MODULE_T periph_module_t
  #else
    #define LGFX_PERIPH_MODULE_T auto
  #endif

    __attribute__ ((unused))
        static LGFX_PERIPH_MODULE_T getPeriphModule(int num)
    {
#if LGFX_HP_I2C_NUM == 1
      return PERIPH_I2C0_MODULE;
#else
      return num == 0 ? PERIPH_I2C0_MODULE : PERIPH_I2C1_MODULE;
#endif
    }

  #undef LGFX_PERIPH_MODULE_T
#endif

    static i2c_dev_t* getDev(int num)
    {
#if LGFX_LP_I2C_NUM > 0
      // The register layout of the low power I2C matches the normal one, which is why
      // ESP-IDF publishes it as an i2c_dev_t as well. Everything below the port lookup
      // therefore works on it unchanged.
      if (isLpPort(num)) { return &LP_I2C; }
#endif
#if LGFX_HP_I2C_NUM == 1
      return &I2C0;
#else
      return num == 0 ? &I2C0 : &I2C1;
#endif
    }

#if defined ( I2C_CLOCK_SRC_ATOMIC )
    __attribute__ ((unused))
    static void i2c_periph_enable(int i2c_num)
    {
      I2C_RCC_ATOMIC() {
        i2c_ll_enable_bus_clock(i2c_num, true);
        i2c_ll_reset_register(i2c_num);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
      I2C_CLOCK_SRC_ATOMIC() {
        i2c_ll_enable_controller_clock(I2C_LL_GET_HW(i2c_num), true);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
    }

    __attribute__ ((unused))
    static void i2c_periph_disable(int i2c_num)
    {
      // periph_ll_disable_clk_clear_rst(mod);
      I2C_CLOCK_SRC_ATOMIC() {
        i2c_ll_enable_controller_clock(I2C_LL_GET_HW(i2c_num), false);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
      I2C_RCC_ATOMIC() {
        i2c_ll_enable_bus_clock(i2c_num, false);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
    }

    __attribute__ ((unused))
    static void i2c_periph_reset(int i2c_num)
    {
      I2C_RCC_ATOMIC() {
        i2c_ll_reset_register(i2c_num);
        (void)__DECLARE_RCC_ATOMIC_ENV;
      }
    }
#else
    __attribute__ ((unused))
    static void i2c_periph_enable(int i2c_num)
    {
      auto mod = getPeriphModule(i2c_num);
      periph_module_enable(mod);
    }

    __attribute__ ((unused))
    static void i2c_periph_disable(int i2c_num)
    {
      auto mod = getPeriphModule(i2c_num);
      periph_module_disable(mod);
    }

    __attribute__ ((unused))
    static void i2c_periph_reset(int i2c_num)
    {
      auto mod = getPeriphModule(i2c_num);
      periph_module_reset(mod);
    }
#endif

#if defined ( CONFIG_IDF_TARGET_ESP32 ) || defined ( CONFIG_IDF_TARGET_ESP32S2 ) || !defined ( CONFIG_IDF_TARGET )

