lovyan03/LovyanGFX/src/lgfx/v1/platforms/esp32/common.cpp
    /// Release SCL and wait for it to actually rise, honoring clock stretching.
    static bool soft_i2c_scl_hi(const soft_i2c_line_t& line)
    {
      gpio_hi(line.scl);
      soft_i2c_half_wait(line.half_us);
      if (gpio_in(line.scl)) { return true; }
      auto us = micros();
      do
      {
        taskYIELD();
        if (gpio_in(line.scl)) { return true; }
      } while ((micros() - us) < 13000); // the same order as the peripheral timeout
      return false;
    }

    /// Returns true when the byte was acknowledged.
    static bool soft_i2c_write_byte(const soft_i2c_line_t& line, uint8_t data)
    {
      size_t i = 0;
      do
      {
        gpio_lo(line.scl);
        if (data & 0x80) { gpio_hi(line.sda); } else { gpio_lo(line.sda); }
        data <<= 1;
        soft_i2c_half_wait(line.half_us);
        if (!soft_i2c_scl_hi(line)) { return false; }
      } while (++i < 8);
      gpio_lo(line.scl);
      gpio_hi(line.sda);  // release the data line for the acknowledge
      soft_i2c_half_wait(line.half_us);
      if (!soft_i2c_scl_hi(line)) { return false; }
      bool ack = !gpio_in(line.sda);
      gpio_lo(line.scl);
      return ack;
    }

    static bool soft_i2c_read_byte(const soft_i2c_line_t& line, uint8_t* data, bool ack)
    {
      uint_fast8_t byte = 0;
      gpio_hi(line.sda);  // released: the device drives the data line
      size_t i = 0;
      do
      {
        gpio_lo(line.scl);
        soft_i2c_half_wait(line.half_us);
        if (!soft_i2c_scl_hi(line)) { return false; }
        byte = (byte << 1) + (gpio_in(line.sda) ? 1 : 0);
      } while (++i < 8);
      gpio_lo(line.scl);
      if (ack) { gpio_lo(line.sda); } else { gpio_hi(line.sda); }
      soft_i2c_half_wait(line.half_us);
      if (!soft_i2c_scl_hi(line)) { return false; }
      gpio_lo(line.scl);
      gpio_hi(line.sda);
      *data = byte;
      return true;
    }

    static void soft_i2c_stop_cond(const soft_i2c_line_t& line)
    {
      gpio_lo(line.scl);
      gpio_lo(line.sda);
      soft_i2c_half_wait(line.half_us);
      soft_i2c_scl_hi(line);
      soft_i2c_half_wait(line.half_us);
      gpio_hi(line.sda);
      soft_i2c_half_wait(line.half_us);
    }

    /// Free a bus whose device was left mid transfer (e.g. by a reset) and holds
    /// the data line, by clocking the leftover bits out.
    static void soft_i2c_recover(const soft_i2c_line_t& line)
    {
      gpio_hi(line.sda);
      size_t i = 0;
      while (!gpio_in(line.sda) && ++i <= 9)
      {
        gpio_lo(line.scl);
        soft_i2c_half_wait(line.half_us);
        soft_i2c_scl_hi(line);
      }
      soft_i2c_stop_cond(line);
    }

    /// Ends a transfer on a failure. The bus is stopped and the lock released
    /// right away; the error is stored so that it surfaces from the following
    /// operation or from endTransaction, as it does on the peripheral path.
    static void soft_i2c_abort(int i2c_port, const soft_i2c_line_t& line)
    {
      soft_i2c_stop_cond(line);
      auto idx = getContextIndex(i2c_port);
      i2c_context[idx].state = cpp::fail(error_t::connection_lost);
      i2c_context[idx].unlock();
    }

    static cpp::result<void, error_t> soft_i2c_send_address(int i2c_port, const soft_i2c_line_t& line, int i2c_addr, bool read)
    {
      bool ack;
      if (i2c_addr <= I2C_7BIT_ADDR_MAX)
      {
        ack = soft_i2c_write_byte(line, i2c_addr << 1 | (read ? 1 : 0));
      }
      else
      {
        ack = soft_i2c_write_byte(line, 0xF0 | (i2c_addr >> 8) << 1)
           && soft_i2c_write_byte(line, i2c_addr & 0xFF);
        if (ack && read)
        { // A 10 bit read re-addresses the high byte in read mode.
          gpio_hi(line.sda);
          soft_i2c_half_wait(line.half_us);
          ack = soft_i2c_scl_hi(line);
          if (ack)
          {
            gpio_lo(line.sda);
            soft_i2c_half_wait(line.half_us);
            gpio_lo(line.scl);
            ack = soft_i2c_write_byte(line, 0xF0 | (i2c_addr >> 8) << 1 | 1);
          }
        }
      }
      if (!ack)
      {
        soft_i2c_abort(i2c_port, line);
        return {};
      }
      i2c_context[getContextIndex(i2c_port)].state
        = read ? i2c_context_t::state_t::state_read : i2c_context_t::state_t::state_write;
      return {};
    }

    static void soft_i2c_set_freq(int i2c_port, uint32_t freq)
    {
      auto idx = getContextIndex(i2c_port);
      i2c_context[idx].freq = freq;
      soft_i2c_half_us[idx - I2C_NUM_MAX] = (freq >= 500000) ? 0 : 500000 / freq;
    }

    static cpp::result<void, error_t> soft_i2c_begin(int i2c_port, int i2c_addr, uint32_t freq, bool read)
    {
      if (i2c_addr < I2C_7BIT_ADDR_MIN || i2c_addr > I2C_10BIT_ADDR_MAX) { return cpp::fail(error_t::invalid_arg); }
      auto idx = getContextIndex(i2c_port);
      i2c_context[idx].lock();
      i2c_context[idx].state = i2c_context_t::state_t::state_disconnect;
      soft_i2c_set_freq(i2c_port, freq);
      auto line = soft_i2c_line(i2c_port);
      gpio_hi(line.sda);
      soft_i2c_scl_hi(line);
      if (!gpio_in(line.sda))
      {
        soft_i2c_recover(line);
      }
      gpio_lo(line.sda);  // start condition
      soft_i2c_half_wait(line.half_us);
      gpio_lo(line.scl);
      return soft_i2c_send_address(i2c_port, line, i2c_addr, read);
    }

    static cpp::result<void, error_t> soft_i2c_restart(int i2c_port, int i2c_addr, uint32_t freq, bool read)
    {
      auto idx = getContextIndex(i2c_port);
      if (i2c_context[idx].state.has_error()) { return cpp::fail(i2c_context[idx].state.error()); }
      soft_i2c_set_freq(i2c_port, freq);
      auto line = soft_i2c_line(i2c_port);
      gpio_hi(line.sda);  // repeated start
      soft_i2c_half_wait(line.half_us);
      if (!soft_i2c_scl_hi(line))
      {
        soft_i2c_abort(i2c_port, line);
        return {};
      }
      gpio_lo(line.sda);
      soft_i2c_half_wait(line.half_us);
      gpio_lo(line.scl);
      return soft_i2c_send_address(i2c_port, line, i2c_addr, read);
    }

    static cpp::result<void, error_t> soft_i2c_end(int i2c_port)
    {
      auto idx = getContextIndex(i2c_port);
      if (i2c_context[idx].state.has_error())
      { // The failing operation has already stopped the bus and released the lock;
        // report its error here and clear it.
        auto err = i2c_context[idx].state.error();
        i2c_context[idx].state = i2c_context_t::state_t::state_disconnect;
        return cpp::fail(err);
      }
      if (i2c_context[idx].state == i2c_context_t::state_disconnect) { return {}; }
      soft_i2c_stop_cond(soft_i2c_line(i2c_port));
      i2c_context[idx].state = i2c_context_t::state_t::state_disconnect;
      i2c_context[idx].unlock();
      return {};
    }

// ------------------------------------------------------------------------

#if LGFX_LP_I2C_NUM > 0 && SOC_RTCIO_PIN_COUNT > 0
    /// Hand a pin back from the low power IO domain.
    /// A pin routed to the low power I2C keeps that routing across a reset, because it is
    /// held in the low power domain rather than by the CPU. Any later attempt to drive it
    /// from a normal port then finds a pad that no longer reaches the peripheral, and the
    /// bus looks dead for reasons nothing in the running program explains. Releasing it
    /// here makes taking a pin over idempotent, whether or not the previous user shut
    /// down in an orderly way.
    static void releaseLpPad(gpio_num_t pin)
    {
      if ((int)pin >= 0 && rtc_gpio_is_valid_gpio(pin))
      {
        rtc_gpio_deinit(pin);
      }
    }
#endif

